#include "delay.h"
//////////////////////////////////////////////////////////////////////////////////	 
//������ֻ��ѧϰʹ�ã�δ���������ɣ��������������κ���;
//Mini STM32������
//ʹ��SysTick����ͨ����ģʽ���ӳٽ��й���
//����delay_us,delay_ms
//����ԭ��@ALIENTEK
//������̳:www.openedv.com
//�޸�����:2010/5/27
//�汾��V1.2
//��Ȩ���У�����ؾ���?
//Copyright(C) ����ԭ�� 2009-2019
//All rights reserved
//********************************************************************************
//V1.2�޸�˵��
//�������ж��е��ó�����ѭ���Ĵ���
//��ֹ��ʱ��׼ȷ,����do while�ṹ!
//////////////////////////////////////////////////////////////////////////////////	 
static u8  fac_us=0;//us��ʱ������
static u16 fac_ms=0;//ms��ʱ������
//��ʼ���ӳٺ���
//SYSTICK��ʱ�ӹ̶�ΪHCLKʱ�ӵ�1/8
//SYSCLK:ϵͳʱ��



void delay_init(u8 SYSCLK)
{


  /* Setup SysTick Timer for 1 msec interrupts  */
//  if (SysTick_Config(SystemCoreClock /1000))
  { 
    /* Capture error */ 
  //  while (1);
  }

  #if 1
	SysTick->CTRL|=0x00000004;//bit2���?,ѡ���ⲿʱ��  HCLK/8
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);	//ѡ���ⲿʱ��  HCLK/8
	if(SYSCLK<8)
	{
		fac_us=1;		    
		fac_ms=420;	
	}
	else
	{
		fac_us=SYSCLK/8;		    	
		fac_ms=(u16)fac_us*1000;	
	}
	// printf("dleay_init :%d \r\n", SYSCLK);
#endif	
}								    
//��ʱnms
//ע��nms�ķ�Χ
//SysTick->LOADΪ24λ�Ĵ���,����,�����ʱ�?:
//nms<=0xffffff*8*1000/SYSCLK
//SYSCLK��λΪHz,nms��λΪms
//��72M������,nms<=1864 
void delay_ms(u16 nms)
{	
//TimingDelay = nms;
#if 1
	u32 temp;		   
	SysTick->LOAD=(u32)nms*fac_ms;//ʱ�����?(SysTick->LOADΪ24bit)
	SysTick->VAL =0x00;           //��ռ�����?
	SysTick->CTRL=0x01 ;          //��ʼ����  
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16)));//�ȴ�ʱ�䵽��   
	SysTick->CTRL=0x00;       //�رռ�����
	SysTick->VAL =0X00;       //��ռ�����?	  	    
	#endif
}   
//��ʱnus
//nusΪҪ��ʱ��us��.		    								   
void delay_us(u32 nus)
{	
//TimingDelay = nus;
#if 1
	u32 temp;	    	 
	SysTick->LOAD=nus*fac_us; //ʱ�����?	  		 
	SysTick->VAL=0x00;        //��ռ�����?
	SysTick->CTRL=0x01 ;      //��ʼ���� 	 
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16)));//�ȴ�ʱ�䵽��   
	SysTick->CTRL=0x00;       //�رռ�����
	SysTick->VAL =0X00;       //��ռ�����?	 
	#endif
}





































